# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\projects\ArloBot\ArlobotHw\DualBoard-043\i2c.cydsn\i2c.cyprj
# Date: Mon, 11 Apr 2016 21:42:24 GMT
#set_units -time ns
create_clock -name {EZI2C_1_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {EZI2C_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 31 61} [list]


# Component constraints for D:\projects\ArloBot\ArlobotHw\DualBoard-043\i2c.cydsn\TopDesign\TopDesign.cysch
# Project: D:\projects\ArloBot\ArlobotHw\DualBoard-043\i2c.cydsn\i2c.cyprj
# Date: Mon, 11 Apr 2016 21:42:23 GMT
