# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\projects\ArloBot\ArlobotHw\DualBoard-043\UART.cydsn\UART.cyprj
# Date: Sat, 23 Apr 2016 04:21:07 GMT
#set_units -time ns
create_clock -name {UART_SCBCLK(FFB)} -period 729.16666666666663 -waveform {0 364.583333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 35 71} [list]


# Component constraints for D:\projects\ArloBot\ArlobotHw\DualBoard-043\UART.cydsn\TopDesign\TopDesign.cysch
# Project: D:\projects\ArloBot\ArlobotHw\DualBoard-043\UART.cydsn\UART.cyprj
# Date: Sat, 23 Apr 2016 04:21:04 GMT
